function addBinary(a, b) {
    return (a + b).toString(2)
}

/*Реализуйте функцию, которая складывает два числа и возвращает их сумму в двоичном виде. Преобразование может быть выполнено до или после сложения.

    Возвращаемое двоичное число должно быть строкой.

    Примеры:(Input1, Input2 --> Output (пояснение))

1, 1 --> "10" (1 + 1 = 2 в десятичной системе счисления или 10 в двоичной)
5, 9 --> "1110" (5 + 9 = 14 в десятичной системе счисления или 1110 в двоичной)

Переведено с помощью www.DeepL.com/Translator (бесплатная версия)*/